# omf
oh-my-fish/plugin-peco
oh-my-fish/plugin-extract

# useful
jethrokuan/z
rafaelrinaldi/pure
edc/bass
decors/fish-ghq
yoshiori/fish-peco_select_ghq_repository

# other
laughedelic/fish_logo
jorgebucaran/fish-spin
